void main()
{


}


/*
★★도전 과제1(현재 배우지 않은 것에 대해 많아서 면접 보러 가기 전까지 무조건! 풀어봐야 할 문제)
문자 / 문자열에 대한 과제 (회사에서 자료형에 대해서 자료형을 반환받는 변수의 자료형에 대해서만 생각하고 메모리 구조 등에 대해서는 파악해보려는 노력을
안한다는 것을 알아서 그것을 검증해보기 위해 무조건 낼 것이다.)★★

- 문제가 어려운건 아니지만 우리가 아직 수업을 나가지 않았기 때문에 어렵게 느낄 수 있는것임.
- 시간이 남을때마다 문제를 풀어보려고 덤벼보기 -

★ 작년 상반기 스마일 게이트 출제 문제 ★

<주의 사항>
C++ 언어로 풀어야 하고, 빈칸을 알맞게 채워 넣으시오.
C 런타임 라이브러리나 STL등 기타 라이브러리 함수를 사용하면 안됩니다.
특히 String을 사용시 바로 탈락 처리되니 유의 바랍니다.
그리고 해당 방법에 대해 왜 그렇게 작성을 했는지 본인의 의견을 주석으로 기입하십시오.

문제. 주어진 문자열을 단어 단위로 순서를 뒤집어 출력하시오.
<예>
입력 값: "Hello World this is Smilegate"
반환 값: "Smilegate is this world Hello"

<조건>
입력 문자열은 앞뒤에 공백이 없다고 가정합니다.
모든 단어는 공백 한 칸으로 구분된다고 가정합니다.

void ReverseWorld(char* output, int outputArraySize, const char＊ input)
{
	// 이곳을 채워 놓으시오.
}

마지막으로 본인이 작성한 로직에 대한 시간 복잡도를 계산하는 수식을 별도의 함수로 구현하고
동작방식과 왜 그렇게 작성했는지에 대해 기술하시오.

*/