	/*
	과제1. 가위바위보

	- 스위치문을 이용하여 제작(조건문을 사용해도 되지만, 베이스가 스위치였으면 좋겠다)

	- 치트 기능과 배팅 기능 추가
	ㄴ 초기 소지금 : 10,000원
	ㄴ 최소 배팅 : 1,000원

	- 5판을 하거나 내가 가진 돈을 전부 잃으면 종료

	- 이기면 판돈의 3배를 얻고, 지면 판돈의 7배를 잃도록 구현

	- 비길경우 판돈의 5배를 얻는다.



	과제2. 숫자 야구

	0 ~ 9 까지의 숫자중 컴퓨터가 임의로 3개를 뽑는다.

	컴퓨터가 뽑은 숫자를 플레이어가 임의의 숫자 3개를 선택하여 숫자와 자리수까지 맞추는 게임
		ㄴ 1. 선택한 숫자가 컴퓨터 숫자와 같으니 자리수가 다른 경우 = n볼(B)
		ㄴ 2. 선택한 숫자가 컴퓨터 숫자와 같고 자리수까지 같을 경우 = n스트라이크(S)
		ㄴ. 3. 해당하는 숫자가 없다면 1 아웃(O)

	- 이렇게 한턴에 3S를 만들경우 몇번만에 맞췄는지 결과를 보여주며 게임을 끝낸다.

	- 필수 : 치트
		ㄴ 배열 X (배열 쓰지 말고 해볼 것)


	
		★★타임 어택. 가위바위보 (if 사용) (월요일에 준비해오기)★★
	- 주어진 시간안에 가위바위보 로직을 작성 후 실행하여 정상 동작되면 OK
	- 반에서 3명이상 실패시 매 과제마다 타임어택이 추가될것이니 열심히 해온다.
	ㄴ. 성공을 못한 인원은 3 X 못한 인원수 = 깜지

	한줄 조사. 배열 + 포인터 조사해오기

	- 노트에 적어온다.

	- 비유할 것 생각해 온다.












	*/