/*
과제 1. 짝 맞추기

- 노 클래스

- 사이즈 : 5 x 4

- ☆ ★/ ◇ ◆/ ♤ ♠/ ♡ ♥/ ♧ ♣

- 아스키 코드를 이용해서 구현하면 좀 더 쉬울 것이다. (아스키 코드는 쓸때만 검색해서 참고하라.(안 외워도 됨)) (못써도 괜찮다)

- 짝이 맞춰진 번호는 계속 오픈된 상태로 유지해야 한다.

- 2가지 버전으로 치트를 만들어 온다.
	ㄴ 1. 치트키를 누르면 패를 전부 오픈시켜 플레이어에게 보여주고 5초뒤에
		  다시 원상 복귀
	ㄴ 2. 치트키를 누르면 한쌍의 카드를 제외하고 전부 오픈
		  이후 사용자가 마지막 한상을 맞추면서 게임이 종료되면 OK

- 종료된 게임에서 재시작하기 기능을 추가할 것

- 월남뽕 과제에서 어려움을 느꼈던 인원은 월남뽕 해설코드를 유의깊게 살펴보고,
비슷한 기능들이 있으므로 어떤식으로 바꿔서 쑤셔넣을지 잘 고민해보자.


※ 과제 유무에 따라서 깜지 없음.



타임 어택. 월남뽕

- 시간은 10분



한줄 조사. 상속

- 비유할것 생각해 온다.
ㄴ 딥하면 그냥 빠지도록

- 노트에 적어온다.
*/