#include<iostream>

using std::cout;
using std::cin;
using std::string;
using std::endl;


/*

과제1. 가위바위보 게임 (다음주 월요일에 하게 될 것의 연계이므로 최대한 간결하게 코딩해보기.)

-if문을 이용해 만든다.
	ㄴ switch 사용하지 말것

- 게임의 진행 횟수는 총 5판
	ㄴ 이후는 게임 종료

- 필수 : 치트(컴퓨터가 무슨 선택지(가위, 바위, 보)중 어떤 것을 낼지 사용자에게 미리 알려주고 확정적으로 이길수 있게 만드는 것.


과제2. 복습, 또 복습하도록

- 지금까지 배운 내용들을 복습한다.

- 그리고 어떻게 복습을 했는지 구현화 시켜온다. (본인이 좀 애먹었던 파트에 대해서 구체적으로 코드를 적어보고 뭔가를 만들어오는 것 best!)






*/














void main() 
{

}