/*

과제1. 클래스

- 클래스를 5개 생성후 각각 다른 문구를 출력한다.

EX) 출력의 형태
(클래스 이름) 클래스 1번
(클래스 이름) 클래스 2번
-
-
(클래스 이름) 클래스 5번


※ 본인이 생각한 가장 효율적인 방법으로 구현해 온다.
(메인함수에 클래스 5개를 한번에 다넣고 출력하는건 지양하라.)


과제2. 문자열

- char 사용할것
- 1. 문자를 입력받아 입력받은 문자를 거꾸로 출력하라.
- EX) ABCD -> DCBA

2. 있는 그대로를 출력하지만 짝수에 있는 문자만 거꾸로 출력
- EX) ABCD -> ADCB

3. 주민번호를 입력하고 -이 제거된 주민번호 출력할것
ㄴ EX) 1234567-12345678 -> 123456712345678


과제3. 하이로우세븐
♠스페이드 / 1 ~13까지의 카드
◆다이아 / 1 ~13까지의 카드
♥하트 / 1 ~13까지의 카드
♣클로버 / 1 ~13 까지의 카드

종류별 13장의 카드 = > 총 52장의 카드 사용 -> 배열

예외처리 -> 추후 처리
ㄴ A = 1
ㄴ J = 11
ㄴ Q = 12
ㄴ K = 13

- 52장의 카드를 최소 한번 이상 랜덤으로 섞고 그후 매턴마다 5장씩 뒤집는다.

- 앞쪽에 배치된 다섯장의 카드를 보고 6번째 카드의 숫자를 예측한다.

- Seven보다 높으면 high, 낮으면 low, 같으면 Seven중 하나에 배팅

- Seven 일 경우 배팅금의 15배 획득
ㄴ 나머지는 건만큼 얻거나 잃거나,


열심히 조사.

- 노트에 적어온다.

- STL + 자료구조 + 알고리즘 + 스텍 + 큐 + 벡터 + 리스트 + 맵 + 반복자 + 컨테이너에 대해서 자세히 조사하기
- STL후위에 명시된 개념은 STL을 알기위해 알아야 하는 관련 내용들이다.









*/