#include<iostream>
#include<iomanip>


using std::cout;
using std::endl;
using std::setw;

void main() {
	/*방어구 특성
		방어력 순서
		(장갑->견갑->하의->상의->투구)

		(	초심자의 투구
			방어력 : 8622
			가격 : 29200

			초심자의 상의
			방어력 : 8324
			가격 : 27400

			초심자의 하의
			방어력 : 7865
			가격 : 25900

			초심자의 견갑
			방어력 : 7451
			가격 : 23500

			초심자의 장갑
			방어력 : 6873
			가격 : 20800
			*/


	cout << "==============================================================" << endl;
	cout << setw(35) << "방어구 정보" << endl;
	cout << "==============================================================" << endl;
	cout << "\n\n\n\n\n\n\n\n\n\n\n\n" << endl;
	cout << "방어구이름 : " << setw(11) << "초심자의 투구/" << setw(11) << "초심자의 상의/" << setw(11) << "초심자의 하의/" << setw(11) << "초심자의 견갑/" << setw(11) << "초심자의 장갑" << endl;
	cout << "\n" << endl;
	cout << "방어력 : " << setw(9) << "8622" << setw(15) << "8324" << setw(14) << "7865" << setw(14) << "7451" << setw(14) << "6873" << endl;
	cout << "\n" << endl;
	cout << "가격 : " << setw(10) << "29200" << setw(15) << "27400" << setw(14) << "25900" << setw(14) << "23500" << setw(14) << "20800" << endl;


}