#include <iostream>
#include <time.h>

//sleep(OneParam)
// ㄴ Sleep(1000) = 

//main 함수 선언 후, 변수를 생성 후 필요하다면 초기화를 진행하는 것을 습관화하라.
// 변수 -> 변수 초기화 -> 할당 -> 반복문 -> 반복문(조건/로직) 구현(??)
#include <windows.h>

using std::cout;
using std::endl;
using std::cin;

void main()
{




}


/*
과제 1. 반복문 출력

for / while / do ~ while문 (3가지 조건/반복문 1번씩 사용하기)

- 20에서 1까지 출력

- 1부터 20까지 출력

ㄴ 짝수만

과제 2. 반복문 숙달 (조건문을 사용해도 되나, 안쓰고 하는 것을 추천한다.)

- 정수 하나를 입력 받아 -5씩 반복적으로 연산되는 식을 구현한다.
	ㄴ 종료 조건: -15를 넘어가면 탈출
	ㄴ 조건 : 입력 받은 값은 -10 ~ +10 사이의 숫자여야 하고 이외의 값이 들어오면 종료

※ while문 사용할것



과제 3. 일수 출력기

- if문과 switch문 중에 본인이 판단해 효율적인 것을 선택할 것.

- 시작하면 사용자의 입력을 받고 입력한 숫자에 따라 ??일인지 출력하면 된다.

EX) 4를 입력 시 -> 4월은 30일까지 있습니다. -> 다시 커맨드 활성화

- 1월 ~12월까지 확인이 가능해야 하고 이외의 숫자는 예외처리

- 총 5번을 입력하면 프로그램은 종료된다.


한줄 조사. 함수

-노트에 적어온다.

- 비유할 것 생각해 온다. (EX: 함수는 OOO이다.)


*/