/*
과제1. 빙고 만들기

- 0 ~ 24까지의 수를 랜덤으로 배치해서 5 x 5로 출력

a.
- 숫자를 선택하면 #, %, & 등으로 바꾼다.

- 빙고가 되면 빙고 카운트가 올라가고 5 빙고가 되면 게임이 종료된다.
ㄴ 게임이 종료되면 프로그램이 종료되는게 아닌 완성된 빙고화면을 계속 보여줘야 한다.
ㄴ 이 화면에서 내가 게임 종료라는 선택지를 고르면 프로그램은 종료된다.

b.
- 위와 룰은 동일하다.

- 단, 혼자하는 빙고가 아닌 AI와 번갈아 가며 플레이 하는 빙고를 만들어 온다.



과제2.

[작업 지시서 작성하기] (작업 지시서는 무조건 기한을 엄수해서 작성하여야 한다.) (해봤다, 제출한다에 의의를 두고 해결하는 것에 의미를 두자)

- 제시된 문서의 내용을 보고 답안을 작성 후 제출하시오.

1. 선다형의 답을 정하고 왜 답으로 선정했는지 본인의 의견을 기술할 것

2. 서술형의 내용을 기입할 것

3. 문제 풀이중 참고를 했다면 반드시 표기할 것 (구글링등을 했을 경우, 참고한 사이트 링크 적기)


중간 과제 점검

- 아래 메일로 "양식"을 꼭 지켜서 보낸다.

메일 주소:
ㄴ star_marker@naver.com

메일 제목:
ㄴ VR 7기_프로그래밍 언어 활용_이름

첨부 파일명:
VR 7기_프로그래밍 언어 활용_이름.zip (압축해서 보내기)

메일 내용:
ㄴ 특이사항 기입
*/