#include<iostream>
#include<iomanip>


using std::cout;
using std::endl;
using std::setw;

void main() {

	/*악세사리 정하기
	(
		반짝이는 금 목걸이
		가격 : 52400
		특성 : 지성 + 3


		귀족의 빛바랜 귀걸이
		가격 : 42300
		특성 : 친절 + 2


		대장장이의 갈무리된 청동반지
		가격 : 75500
		특성 : 용기 + 4


		모험가의 백금 팔찌
		가격 : 66600
		특성 : 매력 + 4

		명인의 찬란한 시계
		가격 : 83000
		특성 :매력 + 6
		*/

	cout << "==============================================================" << endl;
	cout << setw(35) << "악세사리 정보" << endl;
	cout << "==============================================================" << endl;
	cout << "\n\n\n\n\n\n\n\n\n\n\n\n" << endl;
	cout << "악세사리이름 : " << setw(11) << "반짝이는 금 목걸이/" << setw(11) << "귀족의 빛바랜 귀걸이/" << setw(11) << "대장장이의 갈무리된 청동반지/" << setw(11) << "모험가의 백금 팔찌/" << setw(11) << "명인의 찬란한 시계" << endl;
	cout << "\n" << endl;
	cout << "가격 : " << setw(16) << "52400" << setw(22) << "42300" << setw(22) << "75500" << setw(22) << "66600" << setw(22) << "83000" << endl;
	cout << "\n" << endl;
	cout << "특성 : " << setw(18)<< "지성 + 3" << setw(21) << "친절 + 2" << setw(22) << " 용기 + 4" << setw(22) << "매력 + 4" << setw(22) << "매력 + 6" << endl;


	}